# len()        لمعرفة عدد حروف الكلمة

Horus = " Mohammed Mahrous Taha"
print(len(Horus))

print("________________________________________________\n")

# strip()       تزيل المسافات 
# rstrip()      تزيل المسافات من ناحيةاليمين فقط
# lstrip()      تزيل المسافات من ناحيةاليسار فقط

Horus = "          Mohammed Mahrous Taha           "
print(Horus.strip())
print(Horus.rstrip())
print(Horus.lstrip())

print("________________________________________________\n")

# tittle()     بتخلي كل الكلمات بدايتها كابيتل

Horus = " Mohammed mahrous Taha 7mMt"
print(Horus.title())

print("________________________________________________\n")

# capitalize()    تخلي كل الكلمات بدايتها كابيتل ما عدا الكلمات التي بعد الأرقام

Horus = " Mohammed mahrous Taha 7mMt"
print(Horus.capitalize())

print("________________________________________________\n")

# zfill()   بيظبط الأرقام من بداية الصفر علي حسب ما أنت عاوز يكون عدد الأرقام سوا من خانة العشرات أو المئات أو الألفات

a, b, c, d = "1", "11", "111", "1111"

print(a.zfill(3))      #هنا رقم (3) يدل اني عاوز الأرقام تكون مكونة من ثلاثة.. يعني تتكون من 
print(b.zfill(3))
print(c.zfill(3))
print(d.zfill(3))

print("________________________________________________\n")

# upper()       بتخلي الأسم كله كابيتل 

a = "Mohammed Mahrous Taha"
print(a.upper())

print("________________________________________________\n")

# lower()       خلي الأسم كله اسمول 

a = "Mohammed Mahrous Taha"
print(a.lower())

print("________________________________________________\n")

# split()          بتخلي الكلمات عبارة عن قائمة 
# rsplit()         بتخلي الكلمات عبارة عن قائمة من ناحية اليمين علي حسب تحديد عدد الكلمات داخل القوس

a = "I love Python and java and c++"
b = "I love Python and java and c++"

print(a.split())
print(b.rsplit(" ",2))

print("________________________________________________\n")

# center()          بتزين الكلمة علي حسب الشئ اللي حابب تضيفه قبل وبعد الكلمة بالعدد اللي حابب تضيفه وده من داخل القوس

a = "Horus"
print(a.center(7, "$"))      #هنا كتبت رقم 7 لأننا هنحسب عدد حروف الكلمة وهي 5 وهتضيف 2 عليها اللي هما قبل وبعد الكلمة وممكن تضيف العدد اللي انت حابه لكن أهم شئ تحسب معاك عدد الكلمة

print("________________________________________________\n")

# count()           بيعد عدد الكلمة الموجودة في الجملة 

a = "I love Python because Python is Easy"

print(a.count("Python"))               # هنا هيحسب عدد الكلمات اللي اسمها بايثون في الجملة
print(a.count("Python", 0, 25))        # وممكن برضوا تحسب يعد من فين لفين  

print("________________________________________________\n")

# swapcase()         بتحول أي كلمة من كابيتل الي اسمول والعكس 

a = "I Love Python"
b = "i lOVE pYTHON"
print(a.swapcase())
print(b.swapcase())

print("________________________________________________\n")

# startswith()      بتشيك علي الجملة بتبدأ بالحرف اللي انت عاوزه وله لا

g = "I Love Python"                                                                           
print(g.startswith("I"))   
print(g.startswith("L")) 
print(g.startswith("P", 7, 12))       # p هنا بقوله هل الجملة في رقم 7 الي رقم 12 بتبدأ بحرف الـ  

print("________________________________________________\n")

# endswith()      بتشيك علي الجملة بتنتهي بالحرف اللي انت عاوزه وله لا

f = "I Love Python"                                                                           
print(f.endswith("n"))   
print(f.endswith("L")) 
print(f.endswith("e", 2, 6))       # e هنا بقوله هل الجملة في رقم 2 الي رقم 6 بتنتهي بحرف الـ  

print("________________________________________________\n")

# index()         بيبينلك الحرف اللي هتبحث عليه يكون رقم كام في الجملة

k = "I Love Python"
print(k.index("P"))                                                                           
print(k.index("P", 0, 10))    # هنا حددتله يبحثلي لحد رقم 10                                                                          
# print(k.index("P", 0, 5))      مش موجود P علشان حرف الـ Error هنا هيقولي                                                                    

print("________________________________________________\n")

#find()        لكن فيها تركاية index() نفس الية عمل الـ 

d = "I Love Python"
print(d.find("P"))                                                                           
print(d.find("P", 0, 10))    # هنا حددتله يبحثلي لحد رقم 10                                                                          
print(d.find("P", 0, 5))     # -لكن هيقولك اي الارقام الناقصة علشان توصل للحرف وهيكون بالسالب زي هنا هتكون النتيجة 1 Erorr هنا مش هيقولي  

print("________________________________________________\n")

# rjust()        دي لما تحب تضيف حاجة من ناحية اليمين للجملة
# ljust()        دي لما تحب تضيف حاجة من ناحية اليسار للجملة 

s = "Horus"
print(s.rjust(6, "#"))
print(s.ljust(6, "#"))             # أهم شئ متنساش تحسب عدد الحروف اللي في الجملة علشان تضيف عليهم اللي حابب تضيفه

print("________________________________________________\n")

# splitlines()          list دي بترجع الجملة الي نظام الـ 

n = """Mohammed
Mahrous
Taha"""

m = "Mohammed\nMahrous\nTaha"

print(n.splitlines())
print(m.splitlines())

print("________________________________________________\n")

# expandtabs()         بتخليك تتحكم في عدد المسافات بين كل كلمة وكلمة في الجملة

t = "I\tLove\ther\tso\tmuch"         # أي مسافة.. وتوضع بعد كل كلمة tab تعني \t علامة الـ 
print(t.expandtabs(2))               # يمكنك تحديد عدد المسافات التي تريدها من خلال ادخال العدد داخل القوس

print("________________________________________________\n")

# replace(Old Value, New Value, Count)           تقدر من خلالها تستبدل أي كلمة بأي كلمة تاني في الجملة 

z = "One Two Three One One"
print(z.replace("One", "1"))
print(z.replace("One", "1", 2))          # ممكن برضوا تحدد هتغيرها في الجملة كام مرة.. وخليك عارف انها بتتغير بالترتيب حسب العدد اللي طالبه.. زي هنا هيغيرها مرتين وهيسيب الثالثة

print("________________________________________________\n")

# join()           string وتخليها list دي تقدر من خلالها تخرج الكلمات من 

mylist = ["Mohammed", "Mahrous", "Taha"]
print("-".join(mylist))          # زي كدا Dash  ممكن تفصل بعلامة الـ 
print(" ".join(mylist))          # ممكن تعمل مسافة زي كدا
print(", ".join(mylist))         # Comma ممكن  تفصل بعلامة الـ  


